<?php
/******************************************
システム名： 
　旅行商品予約システム
クラス名：
　定数管理（MySQL）
機能名：
　定数管理（MySQL）
*******************************************/

class ConstantMy {
    public static $aryCorrespondence = array(
        '1' => '承認待ち',
        '6' => '非承認',
        '2' => '入金待ち',
        '3' => 'キャンセル',
        '4' => '入金済み',
        '5' => '決済処理中'
    );

    public static $aryPayment = array(
        '1' => '一括',
        '2' => '分割',
        '3' => 'ボーナス一括',
        '4' => 'ボーナス分割',
        '5' => 'リボ'
    );

    public static $aryCategory = array(
        'cat1' => '体験する',
        'cat2' => '見る',
        'cat3' => '食べる',
        'cat4' => '買う'
    );

    public static $aryArea = array(
        'area1' => '黒部・宇奈月',
        'area2' => '立山',
        'area3' => '富山',
        'area4' => '砺波・五箇山',
        'area5' => '高岡・氷見'
    );
    public static $aryAreaDetail = array(
        'area1' => array(
                   'area1_1' => '魚津市',
                   'area1_2' => '黒部市',
                   'area1_3' => '入善町',
                   'area1_4' => '朝日町',
                   'area1_5' => '滑川市'
               ),
        'area2' => array(
                   'area2_1' => '船橋村',
                   'area2_2' => '上市町',
                   'area2_3' => '立山町'
               ),
        'area3' => array(
                   'area3_1' => '富山市'
               ),
        'area4' => array(
                   'area4_1' => '氷見市',
                   'area4_2' => '射水市',
                   'area4_3' => '高岡市'
               ),
        'area5' => array(
                   'area5_1' => '小矢部市',
                   'area5_2' => '砺波市',
                   'area5_3' => '南砺市'
               )
    );

    public static $aryAuthority = array(
        '1' => 'システム管理者',
        '2' => '事業者'
    );

    public static $arySettlementType = array(
        '0' => 'クレジットカード',
        '3' => 'コンビニ'
    );

    public static $aryPriceType = array(
        '0' => 'おとな・こども同額',
        '1' => 'おとな',
        '2' => 'こども',
        '3' => '大学生',
        '4' => '高校生',
        '5' => '中学生',
        '6' => '小学生',
        '7' => '幼児',
        '8' => 'その他'
    );

    public static $aryWeekDay = array(
        '0' => '日',
        '1' => '月',
        '2' => '火',
        '3' => '水',
        '4' => '木',
        '5' => '金',
        '6' => '土'
    );

    public static $aryCancelChargeRate = array(
        '1' => '100%',
        '2' => '90%',
        '3' => '80%',
        '4' => '70%',
        '5' => '60%',
        '6' => '50%',
        '7' => '40%',
        '8' => '30%',
        '9' => '20%',
        '10' => '10%',
        '11' => 'なし'
    );

    public static $aryJob = array(
        '1' => '学生',
        '2' => '会社員',
        '3' => '自営',
        '4' => '主婦',
        '5' => 'その他'
    );

    public static $aryMtCancelTtl = array(
        '1' => '旅行開始後無連絡不参加',
        '2' => '当日',
        '3' => '前日',
        '4' => '2日前まで',
        '5' => '3日前まで',
        '6' => '3日から2日前まで'
    );

    public static $aryMtCancelRatio = array(
        '1' => '100%',
        '2' => '90%',
        '3' => '80%',
        '4' => '70%',
        '5' => '60%',
        '6' => '50%',
        '7' => '40%',
        '8' => '30%',
        '9' => '20%',
        '10' => '10%',
        '11' => 'なし'
    );

    public static $aryMtDisp = array(
        '0' => '削除',
        '1' => '公開',
        '2' => '非公開',
        '3' => '下書き'
    );

    public static $aryGender = array(
        '1' => '男性',
        '2' => '女性'
    );

    public static $aryPref = array(
        '1' => '北海道',
        '2' => '青森県',
        '3' => '岩手県',
        '4' => '宮城県',
        '5' => '秋田県',
        '6' => '山形県',
        '7' => '福島県',
        '8' => '茨城県',
        '9' => '栃木県',
        '10' => '群馬県',
        '11' => '埼玉県',
        '12' => '千葉県',
        '13' => '東京都',
        '14' => '神奈川県',
        '15' => '新潟県',
        '16' => '富山県',
        '17' => '石川県',
        '18' => '福井県',
        '19' => '山梨県',
        '20' => '長野県',
        '21' => '岐阜県',
        '22' => '静岡県',
        '23' => '愛知県',
        '24' => '三重県',
        '25' => '滋賀県',
        '26' => '京都府',
        '27' => '大阪府',
        '28' => '兵庫県',
        '29' => '奈良県',
        '30' => '和歌山県',
        '31' => '鳥取県',
        '32' => '島根県',
        '33' => '岡山県',
        '34' => '広島県',
        '35' => '山口県',
        '36' => '徳島県',
        '37' => '香川県',
        '38' => '愛媛県',
        '39' => '高知県',
        '40' => '福岡県',
        '41' => '佐賀県',
        '42' => '長崎県',
        '43' => '熊本県',
        '44' => '大分県',
        '45' => '宮崎県',
        '46' => '鹿児島県',
        '47' => '沖縄県'
    );

    public static $aryGovernor = array(
        '1' => '観光庁長官',
        '2' => '北海道知事',
        '3' => '青森県知事',
        '4' => '岩手県知事',
        '5' => '宮城県知事',
        '6' => '秋田県知事',
        '7' => '山形県知事',
        '8' => '福島県知事',
        '9' => '茨城県知事',
        '10' => '栃木県知事',
        '11' => '群馬県知事',
        '12' => '埼玉県知事',
        '13' => '千葉県知事',
        '14' => '東京都知事',
        '15' => '神奈川県知事',
        '16' => '新潟県知事',
        '17' => '富山県知事',
        '18' => '石川県知事',
        '19' => '福井県知事',
        '20' => '山梨県知事',
        '21' => '長野県知事',
        '22' => '岐阜県知事',
        '23' => '静岡県知事',
        '24' => '愛知県知事',
        '25' => '三重県知事',
        '26' => '滋賀県知事',
        '27' => '京都府知事',
        '28' => '大阪府知事',
        '29' => '兵庫県知事',
        '30' => '奈良県知事',
        '31' => '和歌山県知事',
        '32' => '鳥取県知事',
        '33' => '島根県知事',
        '34' => '岡山県知事',
        '35' => '広島県知事',
        '36' => '山口県知事',
        '37' => '徳島県知事',
        '38' => '香川県知事',
        '39' => '愛媛県知事',
        '40' => '高知県知事',
        '41' => '福岡県知事',
        '42' => '佐賀県知事',
        '43' => '長崎県知事',
        '44' => '熊本県知事',
        '45' => '大分県知事',
        '46' => '宮崎県知事',
        '47' => '鹿児島県知事',
        '48' => '沖縄県知事'
    );

    public static $aryTravel = array(
        '1' => '旅行業第1種',
        '2' => '旅行業第2種',
        '3' => '旅行業第3種',
        '4' => '地域限定旅行業'
    );

    public static $aryCvs = array(
        '00006' => 'デイリーヤマザキ',
        '00007' => 'セブンイレブン',
        '00009' => 'スリーエフ',
        '10001' => 'ローソン',
        '10002' => 'ファミリーマート',
        '10003' => 'サンクス',
        '10004' => 'サークルＫ',
        '10005' => 'ミニストップ',
        '10008' => 'セイコーマート'
    );

    public static $init_course = array(
        'close_date' => '0',
        'close_time' => null,
        'stock_value' => '0',
        'stock_option' => '0'
    );

}